In [1]:
#Experiment No: 4
#Name:Shravani Karne
#Roll No: 39
#Subject: Data Science Statistic

In [35]:
import pandas as pd

In [36]:
import os

In [37]:
os.getcwd()

'C:\\Users\\Shravani'

In [38]:
os.chdir('C:\\Users\\Shravani')

In [39]:
df=pd.read_csv("salary.csv")

In [40]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [41]:
df.tail()

    YearsExperience  Salary
30             11.2  127345
31             11.5  126756
32             12.3  128765
33             12.9  135675
34             13.5  139465

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   YearsExperience  35 non-null     float64
 1   Salary           35 non-null     int64
dtypes: float64(1), int64(1)
memory usage: 688.0 bytes

In [43]:
df.describe()

       YearsExperience         Salary
count        35.000000      35.000000
mean          6.308571   83945.600000
std           3.618610   32162.673003
min           1.100000   37731.000000
25%           3.450000   57019.000000
50%           5.300000   81363.000000
75%           9.250000  113223.500000
max          13.500000  139465.000000

In [44]:
df.shape

(35, 2)

In [45]:
df.size

70

In [46]:
df.ndim

2

In [47]:
df.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [48]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [49]:
df.columns

Index(['YearsExperience', 'Salary'], dtype='object')

In [50]:
df.loc[4,"Salary"]

39891

In [51]:
df.head(15)

    YearsExperience  Salary
0               1.1   39343
1               1.3   46205
2               1.5   37731
3               2.0   43525
4               2.2   39891
5               2.9   56642
6               3.0   60150
7               3.2   54445
8               3.2   64445
9               3.7   57189
10              3.9   63218
11              4.0   55794
12              4.0   56957
13              4.1   57081
14              4.5   61111

In [52]:
df.loc[4]

YearsExperience        2.2
Salary             39891.0
Name: 4, dtype: float64

In [53]:
a=(1,2,3,4,5,6,7,8,9,10)

In [54]:
a[1:4]

(2, 3, 4)

In [55]:
df.iloc[1,2]

IndexError: single positional indexer is out-of-bounds

In [56]:
df.head()

   YearsExperience  Salary
0              1.1   39343
1              1.3   46205
2              1.5   37731
3              2.0   43525
4              2.2   39891

In [57]:
df.loc[1,"Salary"]

46205

In [58]:
x=df.iloc[:, :-1].values 
y=df.iloc[:, :-1].values

In [59]:
a[:2]

(1, 2)

In [60]:
    a[2:]

(3, 4, 5, 6, 7, 8, 9, 10)

In [61]:
a[1:6:1]

(2, 3, 4, 5, 6)

In [62]:
print(x)

[[ 1.1]
 [ 1.3]
 [ 1.5]
 [ 2. ]
 [ 2.2]
 [ 2.9]
 [ 3. ]
 [ 3.2]
 [ 3.2]
 [ 3.7]
 [ 3.9]
 [ 4. ]
 [ 4. ]
 [ 4.1]
 [ 4.5]
 [ 4.9]
 [ 5.1]
 [ 5.3]
 [ 5.9]
 [ 6. ]
 [ 6.8]
 [ 7.1]
 [ 7.9]
 [ 8.2]
 [ 8.7]
 [ 9. ]
 [ 9.5]
 [ 9.6]
 [10.3]
 [10.5]
 [11.2]
 [11.5]
 [12.3]
 [12.9]
 [13.5]]

In [63]:
print(y)

[[ 1.1]
 [ 1.3]
 [ 1.5]
 [ 2. ]
 [ 2.2]
 [ 2.9]
 [ 3. ]
 [ 3.2]
 [ 3.2]
 [ 3.7]
 [ 3.9]
 [ 4. ]
 [ 4. ]
 [ 4.1]
 [ 4.5]
 [ 4.9]
 [ 5.1]
 [ 5.3]
 [ 5.9]
 [ 6. ]
 [ 6.8]
 [ 7.1]
 [ 7.9]
 [ 8.2]
 [ 8.7]
 [ 9. ]
 [ 9.5]
 [ 9.6]
 [10.3]
 [10.5]
 [11.2]
 [11.5]
 [12.3]
 [12.9]
 [13.5]]